Repository: plone/training
Catalog: _locales/*/LC_MESSAGES/buildout_1.po
Languages: es

source: Buildout I
es: Buildout - Parte I

source: `Buildout <https://pypi.python.org/pypi/zc.buildout>`_ composes your application for you, according to your rules.
es: `Buildout <https://pypi.python.org/pypi/zc.buildout>`_ compone su aplicacion por usted, de acuerdo a sus reglas.

source: To compose your application you must define the eggs you need, which version, what configuration files Buildout has to generate for you, what to download and compile, and so on. Buildout downloads the eggs you requested and resolves all dependencies. You might need five different eggs, but in the end, Buildout has to install 300 eggs, all with the correct version.
es: Para componer su aplicación es necesario definir los paquetes eggs que usted necesita, ¿qué versión?, ¿qué archivos de configuración Buildout tiene que generar para usted?, para descargar y compilar, y así sucesivamente. Buildout descarga los paquetes eggs requeridos y resuelve todas las dependencias. Es posible que tenga cinco paquetes eggs diferentes, pero al final, Buildout tiene que instalar 300 paquetes eggs, todos con la versión correcta.

source: Plone needs folders for logfiles, databases and configuration files. Buildout assembles all of this for you.
es: Plone necesita carpetas para los archivos de registro, bases de datos y archivos de configuración. Buildout ensambla todo esto para usted.

source: You will need a lot of functionality that Buildout does not provide out of the box, so you'll need several extensions. Some extensions provide whole new functionality, like mr.developer, the only way to manage your checked out sources.
es: Usted necesitará una gran cantidad de funcionalidades que Buildout no proporciona fuera de la caja, así que usted necesitará varias extensiones. Algunas extensiones proporcionan una funcionalidad totalmente nueva, como mr.developer, la única manera de manejar sus repositorios de código fuente.

source: Syntax
es: Sintaxis

source: The syntax of Buildout configuration files is similar to classic ini files. You write a parameter name, an equals sign and the value. If you enter another value in the next line and indent it, Buildout understands that both values belong to the parameter name, and the parameter stores all values as a list.
es: La sintaxis de los archivos de configuración de despliegue es similar a los archivos clásicos ini. Usted escribe un nombre de parámetro, un signo igual y el valor. Si introduce otro valor en la siguiente línea y sangría a ella, Buildout entiende que ambos valores pertenecen al nombre del parámetro y el parámetro almacena todos los valores en forma de lista.

source: A Buildout consists of multiple sections. Sections start with the section name in square brackets. Each section declares a different part of your application. As a rough analogy, your Buildout file is a cookbook with multiple recipes.
es: A Buildout consta de múltiples secciones. Secciones comienzan con el nombre de la sección entre corchetes. Cada sección declara una parte diferente de su aplicación. Como analogía aproximada, su archivo Buildout es un libro de cocina con múltiples recetas.

source: There is a special section, called `[buildout]`. This section can change the behavior of Buildout itself. The variable :samp:`parts` defines, which of the existing sections should actually be used.
es: There is a special section, called `[buildout]`. This section can change the behavior of Buildout itself. The variable :samp:`parts` defines, which of the existing sections should actually be used. Hay una sección especial, llamada `[buildout]`. En esta sección se puede cambiar el comportamiento de la propia Buildout. Las variables :samp:`parts` define, cuál de las secciones existentes deben ser efectivamente utilizado.

source: Recipes
es: Recetas

source: Buildout itself has no idea how to install Zope. Buildout is a plugin based system, it comes with a small set of plugins to create configuration files and download eggs with their dependencies and the proper version. To install a Zope site, you need a third-party plugin. The plugin provide new recipes that you have to declare and configure in a section.
es: Buildout por si mismo no tiene idea de como instalar Zope. Buildout es un sistema basado en plugin, este viene con un pequeño set de plugins para crear archivos de configuración y descargar paquetes eggs con sus dependencias y su versión apropiada. Para instalar un sitio Zope, necesitas un plugin de terceros. El plugin provee nuevas recetas que tu tienes que declarar y configurar en una sección.

source: One example is the section
es: Un ejemplo es esta sección.

source: This uses the python-package `plone.recipe.zope2instance <http://pypi.python.org/pypi/plone.recipe.zope2instance>`_ to create and configure the Zope 2 instance which we use to run Plone. All the lines after ``recipe = xyz`` are the configuration of the used recipe.
es: Esto usa el paquete de python `plone.recipe.zope2instance <http://pypi.python.org/pypi/plone.recipe.zope2instance>`_ para crear y configurar la instancia Zope 2 la cual usamos para ejecutar Plone. Todas las lineas después de ``recipe = xyz`` son la configuración de la receta usada.

source: References
es: Referencias

source: Buildout allows you to use references in the configuration. A variable declaration may not only hold the variable value, but also a reference to where to look for the variable value.
es: Buildout le permite usar referencias en la configuración. Una declaración de variable no sólo puede mantener el valor de variable, pero también una referencia al lugar donde buscar el valor de la variable.

source: If you have a big setup with many Plone sites with minor changes between each configuration, you can generate a template configuration, and each site references everything from the template and overrides just what needs to be changed.
es: Si usted tiene una gran instalación con muchos sitios Plone con pequeños cambios entre cada configuración, se puede generar una plantilla de configuración, y cada sitio hace referencia a todo, desde la plantilla y sobreescribe justo en lo que necesita ser cambiado.

source: Even in smaller buildouts this is a useful feature. We are using `collective.recipe.omelette <https://pypi.python.org/pypi/collective.recipe.omelette>`_. A very practical recipe that creates a virtual directory that eases the navigation to the source code of each egg.
es: Incluso en los buildouts más pequeños esta es una característica útil. Estamos utilizando `collective.recipe.omelette <https://pypi.python.org/pypi/collective.recipe.omelette>`_. Una receta muy práctica que crea un directorio virtual que facilita la navegación al código fuente de cada paquete egg.

source: The omelette-recipe needs to know which eggs to reference. We want the same eggs as our instance uses, so we reference the eggs of the instance instead of repeating the whole list.
es: La receta omelette tiene que saber cuales son los paquetes eggs para hacer referencia. Queremos los mismos paquetes eggs, utiliza nuestro ejemplo, por lo que nos referimos a los paquetes eggs de la instancia en lugar de repetir toda la lista.

source: Another example: Say you create configuration files for a webserver like nginx, you can define the target port for the reverse proxy by looking it up from the zope2instance recipe.
es: Otro ejemplo: Digamos que usted crea archivos de configuración para un servidor web como Nginx, puede definir el puerto de destino para el proxy inverso al mirar hacia arriba a partir de la receta zope2instance.

source: Configuring complex systems always involves a lot of duplication of information. Using references in the buildout configuration allows you to minimize these duplications.
es: Configuración de sistemas complejos siempre implica una gran cantidad de duplicación de la información. El uso de referencias en la configuración buildout le permite minimizar estas duplicaciones.

source: A real life example
es: Un ejemplo de la vida real

source: Let us walk through the ``buildout.cfg`` for the training and look at some important variables:
es: Examinemos el archivo ``buildout.cfg`` para el entrenamiento y miremos algunas de las variables mas importantes:

source: When you run ``./bin/buildout`` without any arguments, Buildout will look for this file.
es: Cuando usted ejecuta ``./bin/buildout`` sin argumentos, Buildout buscara por este archivo:

source: Let us look closer at some variables.
es: Echemos un vistazo más de cerca a algunas variables.

source: This line tells Buildout to read more configuration files. You can refer to configuration files on your computer or to configuration files on the Internet, reachable via http. You can use multiple configuration files to share configurations between multiple Buildouts, or to separate different aspects of your configuration into different files. Typical examples are version specifications, or configuration that differ between different environments.
es: Esta línea le dice al Buildout lea más archivos de configuración. Puede hacer referencia a los archivos de configuración en el equipo o los archivos de configuración en Internet, accesible a través de protocolo http. Puede utilizar varios archivos de configuración para compartir entre múltiples configuraciones Buildouts, o para separar los diferentes aspectos de su configuración en archivos diferentes. Ejemplos típicos son especificaciones de la versión o la configuración que difieren entre los diferentes entornos de instalación, por ejemplo, desarrollo, calidad, producción.

source: This is the list of eggs that we configure to be available for Zope. These eggs are put in the python-path of the script ``bin/instance`` with which we start and stop Plone.
es: Esta es la lista de los paquetes eggs que nosotros configuramos a estar disponible para Zope. Estos paquetes eggs se ponen en la ruta de python del script ``bin/instance`` con el cual se iniciara y detendrá con Plone.

source: The egg ``Plone`` is a wrapper without code. Among its dependencies is ``Products.CMFPlone`` which is the egg that is at the center of Plone.
es: El paquete egg ``Plone`` es una envoltura sin código. Entre sus dependencias es ``Products.CMFPlone`` que es el paquete egg que está en el centro de Plone.

source: The rest are addons we already used or will use later. The last eggs are commented out so they will not be installed by Buildout.
es: El resto son complementos que ya hemos usado o usará más tarde. Los últimos paquetes eggs están comentadas por lo que no se instalarán por Buildout.

source: The file ``versions.cfg`` that is included by the ``extends = ...`` statement hold the version-pinnings:
es: El archivo ``versions.cfg`` que se incluye por la declaración ``extends = ...`` contiene las versiones que definimos:

source: This is another special section. It has become a special section by declaration. In our :samp:`[buildout]` section we set a variable :samp:`versions = versions`. This told buildout, that there is a section named versions, containing version information. When Buildout installs eggs it will use the version defined in this section.
es: Esta es otra sección especial. Se ha convertido en una sección especial de declaración. En nuestro :samp:`[buildout]` sección establecemos una variable :samp:`versions = versions`. Esto le dijo a buildout, que existe una sección denominada versiones, que contiene información de las versiones a usar. Cuando Buildout instala paquetes eggs se utilizará la versión definida en esta sección.

source: Hello mr.developer!
es: ¡Hola mr.developer!

source: There are many more important things to know, and we can't go through them in all the detail but I want to focus on one specific feature: **mr.developer**
es: Hay muchas cosas más importantes que debe saber, y no podemos pasar por ellos en todos los detalles, pero quiero centrarme en una característica específica: **mr.developer**

source: With mr.developer you can declare which packages you want to check out from which version control system and which repository URL. You can check out sources from git, svn, bzr, hg and maybe more. Also, you can say that some source are in your local file system.
es: Con mr.developer puede declarar los paquetes que desee comprobar desde o hacia un sistema de control de versiones y de cual dirección URL del repositorio. Usted puede comprobar código fuente desde diversos cvs como git, subversion, bzr, hg y quizá más. También, se puede decir que algún código fuente se encuentran en el sistema de archivos local.

source: ``mr.developer`` comes with a command, ``./bin/develop``. You can use it to update your code, to check for changes and so on. You can activate and deactivate your source checkouts. If you develop your extensions in eggs with separate checkouts, which is a good practice, you can plan releases by having all source checkouts deactivated, and only activate them, when you write changes that require a new release. You can activate and deactivate eggs via the ``develop`` command or the Buildout configuration. You should always use the Buildout way. Your commit serves as documentation.
es: ``mr.developer`` viene con un comando, ``./bin/develop``. Se puede utilizar para actualizar su código fuente, para comprobar los nuevos cambios y así sucesivamente. Usted puede activar y desactivar sus checkouts desde el origen. Si usted desarrolla sus extensiones en los paquetes eggs con checkouts separadas, lo cual es una buena práctica, usted puede planear publicaciones por tener todas los checkouts desactivados, y sólo activarlos, al escribir los cambios que requieren una nueva versión. Usted puede activar y desactivar los paquetes eggs a través del comando ``develop`` o la configuración Buildout. Siempre debe usar la forma Buildout. Su commit sirve como documentación.

source: You might have noticed that most if not all functionality is only available via plugins. One of the things that Buildout excels at without any plugin, is the dependency resolution. You can help Plone in dependency resolution by declaring exactly which version of an egg you want. This is only one use case. Another one is much more important: If you want to have a repeatable Buildout, one that works two months from now also, you *must* declare all your egg versions. Else Buildout might install newer versions.
es: Usted puede haber notado que la mayoría, si no toda la funcionalidad sólo está disponible a través de plugins. Una de las cosas que sobresale en Buildout sin ningún plugin, es la resolución de dependencias. Usted puede ayudar a Plone en la resolución de dependencias, al declarar que es exactamente la versión de un paquete egg que desea. Esto es sólo un caso de uso. Otra es mucho más importante: Si usted quiere tener un Buildout repetible, que trabaja de dos meses a partir de ahora también, se *debe* declarar todas sus versiones de paquete egg. De otro modo Buildout podría instalar las nuevas versiones.

source: Be McGuyver
es: Sea un McGuyver

source: As you can see, you can build very complex systems with Buildout. It is time for some warnings. Be selective in your recipes. Supervisor is a program to manage running servers, its pretty good. There is a recipe for it.
es: Como puede ver, usted puede construir sistemas muy complejos con Buildout. Es hora de que algunas advertencias. Sea selectivo en sus recetas. Supervisor es un programa para gestionar servidores en ejecución, es bastante bueno. No hay una receta para ello.

source: The configuration for this recipe is more complicated than the supervisor configuration itself! By using this recipe, you force others to understand the recipes specific configuration syntax *and* the supervisor syntax. For such cases, `collective.recipe.template <https://pypi.python.org/pypi/collective.recipe.template>`_ is a better match.
es: ¡La configuración para esta receta es más complicada que la propia configuración del supervisor en si! Mediante el uso de esta receta, se fuerza a los demás a comprender la sintaxis de configuración específica recetas y la sintaxis supervisor. Para tales casos, `collective.recipe.template <https://pypi.python.org/pypi/collective.recipe.template>`_ presenta una mejor coincidencia.

source: Another problem is error handling. Buildout tries to install a weird dependency you do not actually want? Buildout will not tell you, where it is coming from.
es: Otro problema es el manejo de errores. ¿Buildout intenta instalar una rara dependencia que en realidad no quiere? Buildout no le dirá, lo que está viniendo.

source: If there is a problem, you can always run Buildout with ``-v``, to get more verbose output, sometimes it helps.
es: Si hay un problema, siempre se puede ejecutar Buildout con la opción ``-v``, para obtener una salida más detallada, a veces ayuda.

source: If strange egg versions are requested, check the dependencies declaration of your eggs and your version pinnings.
es: Si se solicitan las versiones de paquetes eggs extraños, verifique la declaración de las dependencias de los paquetes eggs y su versión definida.

source: Some parts of Buildout interpret egg names case-sensitive, others won't. This can result in funny problems.
es: Algunas partes de Buildout interpretan nombres de paquete egg entre mayúsculas y minúsculas, otros no. Esto puede dar lugar a problemas de divertidos.

source: Always check out the ordering of your extends, always use the :samp:`annotate` command of Buildout to see if it interprets your configuration differently than you. Restrict yourself to simple Buildout files. You can reference variables from other sections, you can even use a whole section as a template. We learned that this does not work well with complex hierarchies and had to abandon that feature.
es: Verifique siempre el orden de su configuraciones extendidas, utilice siempre el comando :samp:`annotate` de Buildout para ver si se interpreta la configuración diferente a la que usted definió. Restringirse a los archivos de despliegue simples. Puede hacer referencia a variables de otras secciones, incluso se puede utilizar toda una sección como plantilla. Hemos aprendido que esto no funciona bien con jerarquías complejas y se tuvo que abandonar esa característica.

source: In the chapter :doc:`deployment_sites` we will have a look at a production-ready for Plone that has many useful features.
es: En el capítulo :doc:`deployment_sites` veremos una configuración de despliegue lista para entornos de producción de Plone que tiene muchas características útiles.

source: Buildout-Documentation
es: Documentación de Buildout

source: Troubleshooting
es: Solución de Problemas

source: The buildout of the unified installer has some valuable documentation as inline-comment
es: El archivo Buildout del instalador unificado tiene documentación valiosa como comentarios entre linea
