Repository: plone/training
Catalog: _locales/*/LC_MESSAGES/configuring_customizing.po
Languages: es

source: Configuring and Customizing Plone through the web
es: Configurando y personalizando Plone a través de la web

source: The Control Panel
es: El panel de control

source: The most important parts of Plone can be configured in the control-panel.
es: Las partes más importantes de Plone pueden ser configuradas en el panel de control.

source: Click on your username
es: Haga clic en el nombre de usuario

source: Click "Site Setup"
es: Haga clic en "Configuración del Sitio"

source: We'll explain every page and mention some of the stuff you can do here.
es: Explicaremos cada pagina y mencionaremos algunas cosas que puedes hacer aquí.

source: Add-ons (later...)
es: Complementos (después)

source: Calendar
es: Calendario

source: Configuration Registry
es: Registro de Configuración

source: Content Rules (we know this already)
es: Reglas de contenido (Ya lo sabemos)

source: Discussion
es: Discusión

source: Editing
es: Edición

source: Errors
es: Errores

source: HTML Filtering
es: Filtrado HTML

source: Image Handling
es: Manejo de Imágenes

source: Language
es: Idioma

source: Mail
es: Correo

source: Maintenance
es: Mantenimiento

source: Markup
es: Etiquetado

source: Navigation
es: Navegación

source: Search
es: Búsqueda

source: Security
es: Seguridad

source: Site
es: Sitio

source: Syndication
es: Sindicación

source: Themes
es: Temas

source: TinyMCE Visual Editor
es: Editor visual TinyMCE

source: Types
es: Tipos

source: Users and Groups
es: Usuarios y Grupos

source: Zope Management Interface (here be dragons)
es: Interfaz de administración de Zope (He aquí dragones)

source: Below the links you find information on your Plone-, Zope and Python-Versions
es: Debajo de los enlaces encontraras información de las versiones en tu Plone, Zope y Python

source: UI fit for smart content-editors
es: Interfaz de usuarios para editores inteligentes de contenido

source: various types
es: Varios tipos

source: portlet-configuration is inherited
es: La configuración de Portles es heredada

source: managing
es: Administrado

source: ordering/weighting
es: ordenando / ampliando

source: will maybe be replaced by tiles
es: quizás sea reemplazado por los tiles

source: Example:
es: Ejemplo:

source: go to http://localhost:8080/Plone/@@manage-portlets
es: Valla a http://localhost:8080/Plone/@@manage-portlets

source: Add a static portlet "Sponsors" on the right side.
es: Agregue un portlet "Patrocinadores" en el lado derecho.

source: Remove the news-portlet and add a new one on the left side.
es: Remueve los nuevos portlets y agrega uno nuevo en el lado izquierdo.

source: Go to the training-folder: http://localhost:8080/Plone/training and click ``Manage portlets``
es: Ir a la carpeta de entrenamiento: http://localhost:8080/Plone/training y haga clic en `Administrar de portlets``

source: Add a static portlet. "Featured training: Become a Plone-Rockstar at Mastering Plone!"
es: Agregue un portlet estático. "Formación destacada: Conviértete en un Rockstar de Plone en la ¡Maestría en Plone!"

source: viewlet have no UI
es: Viewlet no poseen Interfaz de usuario

source: not aimed at content-editors
es: No recomendado para editores de contenido

source: not locally addable, no configurable inheritance.
es: No es localmente agregable, no posee herencia configurable.

source: usually global (depends on code)
es: Usado globalmente (depende del código)

source: will be replaced by tiles?
es: ¿Sera reemplazado por los tiles?

source: the code is much simpler (we'll create one tomorrow)
es: El código es mucho mas simple (crearemos uno mañana)

source: live in viewlet-managers, can be nested (by adding a viewlet that contains a viewlet-manager)
es: En vivo en administradores de viewlet, pueden ser anidadas (agregando un viewlet que contenga un administrador de viewlet)

source: ttw-reordering only within the same viewlet-manager
es: El reordenamiento a través de la Web solo puede ser dentro de su mismo administrador de viewlet

source: the code decides when it's where and what it shows
es: el código decide cuando, dónde y que muestra

source: Portlets save Data, Viewlets usually don't. Viewlets are often used for UI-Elements.
es: Portlets guarda datos, los Viewlets usualmente no lo hacen, los Viewlets a veces son usados para elementos de Interfaz de usuario.

source: Go to http://localhost:8080/Plone/@@manage-viewlets
es: Valla a http://localhost:8080/Plone/@@manage-viewlets

source: Hide collophon
es: Ocultar Colofón (Ocultar pie de pagina)

source: Go to http://localhost:8080/Plone/manage
es: Valla a http://localhost:8080/Plone/manage

source: Zope is the foundation of Plone. Here you can access the inner working of Zope and Plone alike.
es: Zope es la base de Plone. Aquí puedes acceder igualmente al funcionamiento interno de Zope y Plone.

source: Here you can easily break your site so you should know what you are doing.
es: Aquí fácilmente se puede romper su sitio así que usted debe saber lo que está haciendo.

source: We only cover three parts of customisation in the ZMI now. Later on when we added our own code we'll come back to the ZMI and will look for it.
es: Nosotros sólo cubrimos las tres partes de la personalización en el ZMI ahora. Más tarde, cuando agreguemos nuestro propio código fuente vamos a volver a la ZMI y lo buscaremos.

source: At some point you'll have to learn what all that stuff is about. But not today.
es: En algún momento tendrá que aprender, todas las cosas acerca de esto. Pero no hoy.

source: Actions (portal_actions)
es: Acciones (portal_actions)

source: Actions are mostly links. But **really flexible** links.
es: Las acciones son principalmente enlaces. Pero enlaces **realmente flexibles**.

source: Actions are configurable ttw and through code.
es: Las acciones son configurable a través de la Web y a través de código.

source: These actions are usually iterated over in viewlets and displayed.
es: Estas acciones son usualmente Iteradas sobre viewlets y visualizadas.

source: Examples:
es: Ejemplos:

source: Links in the Footer (site_actions)
es: Enlaces en el pie de pagina (site_actions)

source: Actions-Dropdown (folder_buttons)
es: Acciones desplegables (folder_buttons)

source: Actions have properties like:
es: Las acciones tienen propiedades como:

source: description
es: descripción

source: These are the links at the bottom of the page:
es: Estos son los enlaces al fondo de la pagina:

source: Site Map
es: Mapa del Sitio

source: Accessibility
es: Accesibilidad

source: Contact
es: Contacto

source: Site Setup
es: Configuración del Sitio

source: We want a new link to legal information, called "Imprint".
es: Queremos un nuevo enlace a la información legal, llamado "Aviso Legal".

source: Go to ``site_actions`` (we know that because we checked in ``@@manage-viewlets``)
es: Ir a ``site_actions`` (lo sabemos porque lo chequeamos en ``@@manage-viewlets``)

source: Add a CMF Actions ``imprint``
es: Agrega acciones CMF a "Aviso legal"

source: Set URL to ``string:${portal_url}/imprint``
es: Asigna dirección URL a ``string:${portal_url}/imprint``

source: Leave *condition* empty
es: Deje *condition* en blanco

source: Set permission to ``View``
es: Asigne el permiso a ``View``

source: Save
es: Guardar

source: explain
es: explicar

source: Check if the link is on the page
es: Verifique si el enlace esta en la pagina

source: Create new Document `Imprint` and publish
es: Cree un nuevo Documento "Aviso legal" y publiquelo

source: Global navigation
es: Navegación global

source: The horizontal navigation is called ``portal_tabs``
es: La navegación horizontal es llamada ``portal_tabs``

source: go to ``portal_actions`` > ``portal_tabs`` `Link <http://localhost:8080/Plone/portal_actions/portal_tabs/manage_main>`_
es: Ir a ``portal_actions`` > ``portal_tabs`` `Link <http://localhost:8080/Plone/portal_actions/portal_tabs/manage_main>`_

source: Edit ``index_html``
es: Edite ``index_html``

source: Where is the navigation?
es: ¿Donde esta la navegación?

source: The navigation shows content-objects, which are in Plone's root. Plus all actions in portal_tabs
es: La navegación muestra objetos de contenido, los cuales están en el raíz del directorio de Plone, además de las acciones en portal_tabs

source: Explain & edit index_html
es: Edite y explique index_html

source: Configuring the navigation itself is done elsewhere: http://localhost:8080/Plone/@@navigation-controlpanel
es: Configurando la navegación por si mismo es hecho en cualquier parte: http://localhost:8080/Plone/@@navigation-controlpanel

source: If time explain:
es: Si hay tiempo explique:

source: user > undo (cool!)
es: user > undo (¡chevere!)

source: In portal_skins we can change certain images, css-files and templates.
es: En portal_skins podemos cambiar ciertas imágenes, archivos css y plantillas.

source: portal_skins is deprecated technology
es: portal_skins es una tecnología depreciada

source: We only do some minial changes here.
es: Haremos únicamente algunos mínimos cambios aquí.

source: Plone 5 will get rid of a lot of functionality that still lives in portal_skins.
es: Plone 5 tendrá una gran cantidad de funcionalidades que aún vive en portal_skins.

source: We used to do this part of the training with `plone.app.themeeditor <https://pypi.python.org/pypi/plone.app.themeeditor>`_ which has a much nicer UI than the ZMI but also has dependencies that are incompatible with ZopeSkel and is not widely used.
es: Antes solíamos usar como parte del entrenamiento el complemento `plone.app.themeeditor <https://pypi.python.org/pypi/plone.app.themeeditor>`_ que tiene una interfaz de usuario mucho más agradable que la ZMI pero también tiene dependencias que no son compatibles con ZopeSkel y no es muy utilizada.

source: Change some css
es: Cambie algunos archivos css

source: Go to ZMI
es: Ir a ZMI

source: go to portal_skins
es: Ir a portal_skins

source: go to plone_styles
es: Ir a plone_styles

source: go to ``ploneCustom.css``
es: Ir a ``ploneCustom.css``

source: click ``customize``
es: Haga clic en ``customize``

source: Enter the following css:
es: Ingrese el siguiente css:

source: Click 'save' and check results in the a different browser-tab. How did that happen?
es: Haga clic en "Save" y verifique los resultados en otra pestaña del navegador. ¿Cómo sucedió eso?

source: The UI leaves a lot to be desired. In a professional context this is no-go (no version-control, no syntax-highlighting etc. pp.). But everybody uses portal_skins it to make quick fixes to sites that are already online.
es: La interfaz de usuario deja mucho que desear. En un contexto profesional esto es inútil (sin control de versiones, no resaltado de sintaxis, etc pp). Pero todo el mundo usa la herramienta portal_skins, para hacer arreglos rápidos a los sitios que ya están en línea.

source: Let's add some more css to make our site a little responsive:
es: Vamos a añadir un poco más estilos CSS para hacer nuestro sitio un poco responsive:

source: Change the logo
es: Cambia el logotipo

source: Let's change the Logo.
es: Cambiemos el Logotipo.

source: Download a old ploneconf logo: http://www.sixfeetup.com/blog/2011PloneConfLogo.gif
es: Baje una versión antigua del logotipo de la ploneconf: http://www.sixfeetup.com/blog/2011PloneConfLogo.gif

source: Go to ``portal_skins`` / ``plone_images``
es: Ir a ``portal_skins`` / ``plone_images``

source: Click on ``logo.png``, click ``Customize`` and Upload the Logo.
es: Haga clic en ``logo.png``, luego haga clic en ``Customize`` y suba el Logotipo.

source: Change the footer
es: Cambiar el pie de pagina

source: Go to ``portal_view_customizations``
es: Ir a ``portal_view_customizations``

source: Search ``plone.footer``, click and customize
es: Busque ``plone.footer``, haga clic y personalice

source: replace the content with the following
es: reemplace el contenido con lo siguiente

source: CSS-Registry (portal_css)
es: Registro de CSS (portal_css)

source: go to ZMI > ``portal_css``
es: Ir a ZMI > ``portal_css``

source: at the bottom there is ``ploneCustom.css``
es: en el fondo esta el archivo ``ploneCustom.css``

source: Disable ``Development mode``: The css-files are merged and have a cache-key.
es: Deshabilite ``Development mode``: Los archivos css serán mezclados y teniendo un cache-key.

source: Further tools in the ZMI
es: Mas herramientas en el ZMI

source: There are many more noteable items in the ZMI. We'll visit some of them later.
es: Hay muchos mas elementos notables en el ZMI, los visitaremos mas tarde.

source: Summary
es: Resumen

source: You can configure and customize a lot in Plone through the web. The most important options are accessible in the `plone control panel <http://localhost:8080/Plone/@@overview-controlpanel>`_ but even more are hidden away in the `ZMI <http://localhost:8080/Plone/manage>`_. The amount of stuff is overwhelming but you'll get the hang of it through a lot of practice.
es: Puedes configurar y personalizar muchas cosas en Plone a través de la web. Las opciones mas importantes son accesibles en el `panel de control plone <http://localhost:8080/Plone/@@overview-controlpanel>`_ pero aun mas están escondidas en el `ZMI <http://localhost:8080/Plone/manage>`_. La cantidad de cosas son abrumante mas tendrás el control luego de mucha practica.
