Repository: plone/training
Catalog: _locales/*/LC_MESSAGES/instructions.po
Languages: es

source: Installing Plone for the Training
es: Instalando Plone para el entrenamiento

source: To not waste too much time with installing and debugging the differences between systems we use a virtual machine (Ubuntu 14.04) to run Plone during the training. We rely on Vagrant and VirtualBox to give the same development-environment to everyone.
es: Para no perder demasiado tiempo con la instalación y la depuración de las diferencias entre los sistemas que utilizamos una máquina virtual (Ubuntu 14.04) para ejecutar Plone durante el entrenamiento. Contamos con Vagrant y VirtualBox para dar el mismo medio de ambiente de desarrollo para todos.

source: `Vagrant <http://www.vagrantup.com>`_ is a tool for building complete development environments. We use it together with Oracle’s `VirtualBox <https://www.virtualbox.org>`_ to create and manage a virtual environment.
es: `Vagrant <http://www.vagrantup.com>`_ es una herramienta para la creación de entornos de desarrollo completos. Lo usamos en conjunto con Oracle’s `VirtualBox <https://www.virtualbox.org>`_ para crear y administrar un entorno virtual.

source: Keep in mind that you need a fast internet-connection during the process since you'll have to download a complete virtual machine (ubuntu) and several packages and updates.
es: Tenga en cuenta que usted necesitará una conexión de Internet rápida durante el proceso, ya que tendrá que descargar una máquina completa virtual (Ubuntu) y varios paquetes y actualizaciones.

source: We recommend using a virtual machine for the training if you are not used to running Plone on your laptop.
es: Recomendamos el uso de una máquina virtual para el entrenamiento si usted no está acostumbrado a correr Plone en su computadora portátil.

source: You can also work on your own machine with your own Python if you want to but **please please please** make sure that you have a system that will work since we don't want you to lose valuable time.
es: También puede trabajar en su propia máquina con su propio Python si quieres, pero **por favor, por favor, por favor**, asegúrese de que usted tiene un sistema que funcione, ya que no queremos que se pierda un tiempo valioso.

source: If you want to use your own system use the Buildout at https://github.com/starzel/training_without_vagrant.git (since the one we set up with puppet has several directories set to folders not shared with the host).
es: Si desea utilizar su propio sistema use el Buildout en https://github.com/starzel/training_without_vagrant.git (desde el, hemos creado con puppet varios directorios establecidos a carpetas no compartidas con el host).

source: Set up Plone for the training like this if you don't want to use a VM:
es: Configurar Plone para el entrenamiento de este tipo si usted no desea utilizar una máquina virtual:

source: Install VirtualBox
es: Instalar VirtualBox

source: Vagrant uses Oracle’s VirtualBox to create virtual environments. Here is a link directly to the download page: https://www.virtualbox.org/wiki/Downloads. We use VirtualBox 4.3.x.
es: Vagrant utiliza VirtualBox de Oracle para crear entornos virtuales. Aquí hay un enlace directo a la página de descarga: https://www.virtualbox.org/wiki/Downloads. Utilizamos VirtualBox 4.3.x.

source: Install and configure Vagrant
es: Instalar y configurar Vagrant

source: Get the latest version from http://www.vagrantup.com/downloads for your operating system and install it.
es: Obtenga la última versión de http://www.vagrantup.com/downloads para su sistema operativo y proceda a instalarlo.

source: In Windows there is a bug in the recent version of Vagrant. Here are the instruction how to work around the warning ``Vagrant could not detect VirtualBox! Make sure VirtualBox is properly installed``.
es: En Windows hay un error en la versión reciente de Vagrant. Aquí están las instrucciones de cómo evitar la advertencia ``Vagrant could not detect VirtualBox! Make sure VirtualBox is properly installed``.

source: Now your system has a command ``vagrant`` that you can run in the terminal.
es: Ahora el sistema dispone de un comando ``vagrant`` que se puede ejecutar en el terminal.

source: First create a directory where you want to do the training in.
es: En primer lugar crear un directorio en el que desea hacer el entrenamiento.

source: Setup Vagrant to automatically install the current guest-additions. You can choose to skip this step if you encounter any problems with it.
es: Al instalar Vagrant instala automáticamente los actuales guests adicionales. Usted puede optar por omitir este paso si tiene algún problema con ella.

source: Now either get the attachmed zip-file (if you read this as a mail) or download it from :download:`http://starzel.github.io/training/plone_training_config.zip <../plone_training_config.zip>`.
es: Ahora bien obtener el archivo zip adjunto (si usted lee esto como un correo electrónico) o descargarlo desde :download:`http://starzel.github.io/training/plone_training_config.zip <../plone_training_config.zip>`.

source: and copy its contents into your training directory. It should now hold the file "Vagrantfile" and the directory ``manifests``.
es: y copiar su contenido en el directorio del entrenamiento. Ahora debería contener el archivo "Vagrantfile" y el directorio se ``manifests``.

source: Now start setting up the VM that is configured in "Vagrantfile"
es: Ahora empieza la creación de la máquina virtual que se configura en el archivo "Vagrantfile"

source: This takes a **veeeeery loooong time** since it:
es: Esto toma un tiempo **muuuuuy largo** ya que:

source: downloads a virtual machine (Official Ubuntu Server 14.04 LTS, also called "Trusty Tahr")
es: descarga una máquina virtual (Official Ubuntu Server 14.04 LTS, también llamado "Trusty Tahr")

source: sets up the VM
es: establece la VM

source: updates the VM
es: actualiza la VM

source: installs various packages needed for Plone development
es: instala varios paquetes necesarios para el desarrollo de Plone

source: downloads and unpack the unified installer for Plone
es: descargas y desempaquetar el instalador unificado de Plone

source: runs the unified installer for Plone.
es: corre el instalador unificado de Plone.

source: copy the eggs to a location we use in the training
es: copia los paquetes eggs a un lugar, los utilizamos para el entrenamiento

source: clones the training-buildout into /vagrant/buildout
es: clona el directorio buildout ``training`` en el directorio ``/vagrant/buildout``

source: builds Plone using the eggs from the buildout-cache
es: construye Plone usando los paquetes eggs del directorio buildout-cache

source: Sometimes this stops with the message *Skipping because of failed dependencies*.
es: A veces esto se detiene con el mensaje *Skipping because of failed dependencies*.

source: If this happens or you have the feeling that something has gone wrong and the installation has not finished correctly for some reason you need to run try the following command to repeat the process. This will only repeat steps that have not finished correctly.
es: Si esto sucede o usted tiene la sensación de que algo ha ido mal y la instalación no ha finalizado correctamente por alguna razón usted necesita ejecutar para intentar el comando siguiente para repetir el proceso. Esto sólo se repetirá los pasos que no han terminado correctamente.

source: You can do this multiple times to fix problems, e.g. if your network-connection was down and steps could not finish because of this.
es: Usted puede hacer esto varias veces para arreglar los problemas, por ejemplo, si su conexión a red es limitada y los pasos no se pudieron terminar debido a esto.

source: Once Vagrant finishes the provisioning-process, you can login to the now running virtual machine.
es: Una vez Vagrant termina el proceso de aprovisionamiento, se puede acceder a la máquina virtual en ejecución.

source: If you have to use Windows you'll have to login to with `putty <http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html>`_. Connect to vagrant@127.0.01 at port 2222. User _and_ password are `vagrant`.
es: Si usted tiene que usar Windows tendrás que iniciar sesión para con `putty <http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html>`_. Conecte a vagrant@127.0.01 en el puerto 2222. usuario y contraseña son `vagrant`.

source: You are now logged in as the user vagrant in ``/home/vagrant``. We'll do all steps of the training as this user.
es: Ahora está iniciado con el usuario vagrant en ``/home/vagrant``. Vamos a hacer todos los pasos del entrenamiento como este usuario.

source: We pre-installed a fresh Plone for you in the folder ``/home/vagrant/Plone/zinstance`` You can run it now and access it from the browser. We will **not** use this Plone-instance in the training, so you can play around with it as much as you want.
es: Nosotros pre-instalamos un Plone para usted en la directorio ``/home/vagrant/Plone/zinstance``. Puede ejecutarlo ahora y acceder a esta instalación desde el navegador. Nosotros **no** vamos a utilizar este instancia Plone en el entrenamiento, por lo que podemos jugar un rato con esta tanto como usted desea.

source: Instead we use our own Plone-instance during the training. It is in ``/vagrant/buildout/``. Start it in foreground with ``./bin/instance fg``.
es: En su lugar usamos nuestra propia instancia Plone durante el entrenamiento. Es en el directorio ``/vagrant/buildout/``. Inicie en modo foreground con el comando ``./bin/instance fg``.

source: Now the Zope-instance we're using is running. You can stop the running instance anytime using ``ctrl + c``.
es: Ahora la instancia Zope que estamos utilizando se está ejecutando. Puede detener la instancia en ejecución en cualquier momento utilizando ``ctrl + c``.

source: You can now point your local browser at http://localhost:8080 and see the Plone that is running in vagrant. This works because Virtualbox forwards the port 8080 from the guest-system (the vagrant-Ubuntu) to the host-system (your normal operating-system). Now create a new Plone-Site by clicking "Create a new Plone-Site". The username and the password are both "admin" (Never do this on a real site!).
es: Ahora puede escribir en el navegador la dirección local en http://localhost:8080 y ve el sitio Plone que se ejecuta en vagrant. Esto funciona porque Virtualbox reenvía al puerto 8080 desde el sistema invitado (el vagrant de Ubuntu) para el sistema anfitrión (el sistema operativo normal). Ahora crear un nuevo sitio Plone haciendo clic en "Crear un nuevo Sitio Plone". El nombre de usuario y la contraseña son "admin" (¡Nunca hagas esto en un sitio real!).

source: The Buildout for this Plone is in a shared folder, this means we run it in the vagrant-box from ``/vagrant/buildout`` but we can also access it in out own operating-system and use our favorite editor. You will find the directory ``buildout`` in the directory ``training`` that you created in the very beginning next to ``Vagrantfile`` and ``manifests``.
es: El Buildout para este Plone está en una carpeta compartida, esto significa lo ejecutamos en la vagrant-box desde el directorio ``/vagrant/buildout`` pero también podemos acceder a este desde fuera del propio sistema operativo y el uso de nuestro editor favorito. Usted encontrará el directorio de ``buildout`` en el directorio del ``training`` que creó en el principio junto al archivo ``Vagrantfile`` y ``manifests``.

source: The database and the python-packages are **not accessible** in you own system since large files and you canot use symlinks in shared folders. The database lies in ``/home/vagrant/var``, the python-packages are in ``/home/vagrant/omelette``.
es: La base de datos y los paquetes python **no son es accesible** en tu propio sistema, ya que los archivos grandes y no se puede utilizar enlaces simbólicos en los directorios compartidos. La base de datos se encuentra en ``/home/vagrant/var``, los paquetes python están en ``/home/vagrant/omelette``.

source: If you have any problems or questions please mail us at team@starzel.de
es: Si usted tiene cualquier problema o pregunta, por favor envíenos un correo electrónico a team@starzel.de

source: What Vagrant does
es: ¿Qué hace Vagrant?

source: These steps are automatically done by vagrant and puppet. They are only explained here if you want to know what goes on below the hood.
es: Estos pasos se realizan automáticamente por vagrant y puppet. Ellos sólo se explican aquí si quieres saber lo que pasa por debajo de la capucha.

source: Puppet does the first installation, Puppet is a tool to automatically manage servers (real and virtual). We won't get into Puppet since it is not that widely used. This is what we basically do if we did it by hand:
es: Puppet hace la primera instalación, Puppet es una herramienta para gestionar automáticamente los servidores (reales y virtuales). No vamos a entrar en Puppet, ya que no es la que utiliza ampliamente. Esto es lo que básicamente hacemos si lo hacemos a mano:

source: First we update the ubuntu and install some packages.
es: Primero actualizamos el Ubuntu e instalamos algunos paquetes.

source: Then we create a virtual python environement using virtualenv. This is alway a good practice since that way we get a clean copy of our system-python, we can't break it by installing eggs that might collide with other eggs::
es: Luego creamos un entorno virtual python usando virtualenv. Esto es todos los días una buena práctica, ya que de esa manera se obtiene una copia limpia de nuestro python del sistema, no podemos romper la instalación previa, por la instalación de los paquetes eggs que pudieran colisionar con otros paquetes eggs::

source: Then we download, unpack and install the unified installer of Plone.
es: Luego descargamos, descomprimimos e instalamos con el instalador unificado de Plone.

source: The unified installer is an amazing tool that compiles it's own python, brings with it all the python-eggs we need and puts them in a buildout-cache. It then creates a Buildout and makes Plone ready to run.
es: El instalador unificado es una excelente herramienta que compila su propio interprete python, trae consigo todas los paquetes eggs python que necesitamos y los pone en un buildout-cache. A continuación, crea un Buildout y hace Plone listo para correr.

source: We will not actually use this Plone during the training. If you want to use it for your own experiments, you can find it in ``/home/vagrant/Plone/zinstance`` on the virtual machine.
es: No vamos a utilizar realmente este Plone durante el entrenamiento. Si usted desea utilizarlo para sus propios experimentos, se puede encontrar en ``/home/vagrant/Plone/zinstance`` en la máquina virtual.

source: Instead vagrant now creates our own little Buildout and only uses the eggs that the unified installer created. First we copy the buildout-cache that holds all the python-packages that Plone consists of.
es: En lugar vagrant ahora crea su propio pequeño Buildout y sólo utiliza los paquete eggs que el instalador unificado ha creado. Primero copiamos el directorio buildout-cache que contiene todos los paquetes python que consta de Plone.

source: Then we checkout our tutorial buildout from https://github.com/starzel/training_buildout and build it.
es: Luego comprobamos nuestro buildout del tutorial de https://github.com/starzel/training_buildout y construimos.

source: At this point vagrant has finished it's job.
es: En este punto vagrant ha terminado su trabajo.

source: You can now connect to the machine and start plone.
es: Ahora puede conectarse a la máquina y iniciar a plone.

source: Now we have fresh Buildout based Zope site, ready to get a Plone site. Go to http://localhost:8080 and create a Plone site, only activate the :guilabel:`Dexterity-based Plone Default Types` plugin.
es: Ahora tenemos un sitio Zope basado Buildout, dispuesto a tener un sitio Plone. Ir a http://localhost:8080 y cree un sitio Plone, sólo activar el complemento :guilabel:`Dexterity-based Plone Default Types`.

source: You might wonder, why we use the unified installer. We use the unified installer to set up a cache of packages to download in a much shorter time. Without it, your first Buildout on a fresh computer would take more than half an hour on a good internet connection.
es: Usted podría preguntarse, ¿por qué se utiliza el instalador unificado?. Utilizamos el instalador unificado para establecer una caché de paquetes para descargar en un tiempo mucho más corto. Sin ella, su primera construcción del Buildout en un ordenador tomaría más de media hora en una buena conexión a Internet.
