Repository: plone/training
Catalog: _locales/*/LC_MESSAGES/intro_advanced_2.po
Languages: es

source: Part 1 in nutshell
es: Parte 1 en pocas palabras

source: The case study
es: El caso de estudio

source: For this training we will build a website for a fictional Plone conference.
es: Para este entrenamiento construiremos un Sitio Web para una conferencia ficticia de Plone.

source: Main features will be:
es: Las principales características serán:

source: As a visitor I want to find current information on the conference
es: Como un visitante, yo quiero encontrar información actualizada en la conferencia.

source: As a visitor I want to register for the conference
es: Como visitante, yo quiero registrarme para la conferencia.

source: As a visitor I want to see the talks and sort them by my preferences
es: Como visitante, yo quiero ver las charlas y ordenarlas por mis preferencias.

source: As a speaker I want to be able to submit talks
es: Como un ponente, yo quiero ser capaz de enviar charlas.

source: As a speaker I want to see and edit my submitted talks
es: Como un ponente, yo quiero ver y editar mis charlas enviadas.

source: As a jury-member I want to vote on talks
es: Como miembro del jurado, yo quiero votar en las charlas.

source: As a jury-member I want to decide, which talks to accept, and which not
es: Como miembro del jurado, yo quiero decidir, cuales charlas aceptar, y cuales no.

source: As an organizer I want to see a list of all proposed talks
es: Como organizador, yo quiero ver una lista de todas las charlas propuestas.

source: Note that all of our requirements connect roles with capabilities. This is important because we'll want to limit the capabilities to those to whom we assign particular roles.
es: Tenga en cuenta que todos nuestros requisitos conectar roles con sus capacidades. Esto es importante porque vamos a querer limitar las capacidades de aquellos a los que asignamos roles particulares.

source: The Anatomy of Plone
es: La Anatomía de Plone

source: Full chapter: :doc:`anatomy`
es: Capítulo completo: :doc:`anatomy`

source: Zope2 is a web application framework that Plone runs on top of.
es: Zope es un framework de aplicación Web el cual Plone corre encima de él.

source: ZODB is the Object Database used
es: ZODB es la base de datos de objetos utilizada

source: `CMF (Content Management Framework) <http://old.zope.org/Products/CMF/index.html/>`_ is an add-on for Zope to build Content Management Systems (like Plone).
es: `CMF (Content Management Framework) <http://old.zope.org/Products/CMF/index.html/>`_ es un complemento para Zope para construir sistemas de gestión de contenido (como Plone).

source: Zope Toolkit / Zope3 was intended as a ground-up rewrite of Zope.
es: Zope Toolkit / Zope 3 fue originalmente creada como una profunda re-escritura de Zope.

source: Plone uses parts of it provided by the `Zope Toolkit (ZTK) <https://zopetoolkit.readthedocs.io/en/latest/>`_.
es: Plone usa partes provistas por el `Zope Toolkit (ZTK) <https://zopetoolkit.readthedocs.io/en/latest/>`_.

source: Zope Component Architecture (ZCA) is a system which allows for component pluggability and complex dispatching. I is based on objects which implement an interface (a description of a functionality). Pyramid, and independent Python web application server, uses the ZCA “under the hood” to perform view dispatching and other application configuration tasks.
es: La Zope Component Architecture (ZCA) es un sistema el cual permite por la versatibilidad y despacho de aplicaciones. Es basada en objetos que implementan una interfaz (una descripción de una funcionalidad). Pyramid, y el servidor de aplicaciones Web Python independiente, utiliza la ZCA "bajo la capucha" para ejecutar despacho de vistas y otras tareas de configuración de aplicación.

source: Acquisition
es: Adquisición

source: The Features of Plone
es: Las características de Plone

source: Full chapter: :doc:`features`
es: Capítulo completo: :doc:`features`

source: Starting/Stopping
es: Iniciando y Deteniendo Plone

source: We control Plone with a small script called "instance"::
es: Tenemos el control de Plone con un pequeño script llamado "instance"::

source: Go to http://localhost:8080/Plone to see the site that comes with the provided database.
es: Valla a la dirección URL http://localhost:8080/Plone para ver el sitio que viene con la base de datos proporcionada.

source: Users
es: Usuarios

source: Let's create a Plone user which we use for most of the training:
es: Vamos a crear un usuario de Plone que usamos para la mayor parte del entrenamiento:

source: :guilabel:`admin` > :guilabel:`Site setup` > :guilabel:`Users and Groups`
es: :guilabel:`admin` > :guilabel:`Configuración de sitio` > :guilabel:`Usuarios y Grupos`

source: Add a user ``training`` with password: ``training``. Add him to the group Administrators
es: Add a user ``training`` with password: ``training``. Add him to the group Administrators Añada un usuario llamado ``training`` con la contraseña: ``training``. Agregarlo al grupo Administradores

source: We already have the following users in the provided Database:
es: Ya tenemos los siguientes usuarios en la Base de datos proporcionada:

source: "editor:editor" (groups: None)
es: "editor:editor" (grupos: Ninguno)

source: "jurymember:jurymember" (groups: None)
es: "jurymember:jurymember" (grupos: Ninguno)

source: "testuser:testuser" (groups: None)
es: "testuser:testuser" (grupos: Ninguno)

source: The mailserver is already configured. Please do not abuse the account. We'll disable it after the training.
es: El servidor de correo ya está configurado. Por favor, no abuses de esto. Lo desactivaremos después del entrenamiento.

source: The Plone UI
es: La Interfaz de Usuario Plone

source: Content-Types
es: Tipos de Contenido

source: These are the default content-types:
es: Estos son los tipos de contenidos por defecto:

source: Document
es: Documento

source: News Item
es: Noticia

source: Event
es: Evento

source: File
es: Archivo

source: Image
es: Imagen

source: Link
es: Enlace

source: Folder
es: Carpeta

source: Collection
es: Colección

source: Please keep in mind that we use `plone.app.contenttypes <http://docs.plone.org/4/en/external/plone.app.contenttypes/docs/README.html>`_ for the training. Therefore the types are based on Dexterity and slightly different from the types that you will find in a default-Plone 4.3.x-site.
es: Por favor, tenga en cuenta que usamos `plone.app.contenttypes <http://docs.plone.org/4/en/external/plone.app.contenttypes/docs/README.html>`_ para la formación. Por lo tanto, los tipos se basan en Dexterity y un poco diferente de los tipos que se encuentran en un sitio Plone 4.3.x por defecto.

source: We created a site-structure:
es: Nosotros creamos una estructura del sitio:

source: Add folder "The Event" and in that ...
es: Agregar carpeta "El Evento" y que contenga...

source: Folder "Talks"
es: Carpeta "Charlas"

source: Folder "Training"
es: Carpeta "Entrenamientos"

source: Folder "Sprint"
es: Carpeta "Sprint"

source: In /news: Added a News Item "Conference Website online!" with some image
es: En la ruta /news: Agregar una Noticia "¡Sitio Web de la Conferencia esta en linea!" con alguna imagen

source: In /news: Added a News Item "Submit your talks!"
es: En la ruta /news: Agregar una Noticia "¡Enviar sus charlas!"

source: In /events: Added an Event "Deadline for talk-submission" Date: 10.10.2014
es: En la ruta /events: Agregar un Evento "Fecha limite para enviar charlas" Fecha 10.10.2014

source: Added a Folder "Register"
es: Agregada una carpeta llamada "Registro"

source: Deleted the Folder "Members" (Users)
es: Eliminado la carpeta llamada "Members" (Usuarios)

source: Added a Folder "Intranet"
es: Agregada carpeta llamada "Intranet"

source: Some core-features
es: Algunas características principales

source: folder_contents
es: explicar /folder_contents

source: Collections
es: Colecciones

source: Content Rules
es: Reglas de Contenido

source: Versioning
es: Versionando

source: Members, roles and groups
es: Miembros, usuarios y grupos

source: Workflows
es: Flujos de trabajos

source: Working copy
es: Copia de trabajo

source: Placeful workflows
es: Flujos de trabajo Placeful

source: Configuring and Customizing Plone
es: Configurando y personalizando Plone

source: Full chapter: :doc:`configuring_customizing`
es: Capítulo completo: :doc:`configuring_customizing`

source: The Control Panel http://localhost:8080/Plone/@@overview-controlpanel
es: El panel de control http://localhost:8080/Plone/@@overview-controlpanel

source: portal_actions (We added a link to ``string:${portal_url}/imprint``)
es: portal_actions (Nosotros agregamos un enlace a ``string:${portal_url}/imprint``)

source: portal_skins (we changed some css and changed the logo)
es: portal_skins (nosotros cambiamos algún css y cambiamos el logotipo)

source: portal_view_customizations (we customized the footer)
es: portal_view_customizations (nosotros personalizamos el pie de página)

source: Extending Plone
es: Extendiendo Plone

source: Full chapter: :doc:`extending`
es: Capítulo completo: :doc:`extending`

source: Component Architecture (zcml)
es: Arquitectura de Componente (zcml)

source: Extend Plone with Add-On Packages
es: Extiende Plone con paquetes Complementos

source: Full chapter: :doc:`addons`
es: Capítulo completo: :doc:`addons`

source: Finding addons
es: Buscando complementos

source: noteable add-ons
es: complementos notables

source: Installing Add-ons
es: Instalando complementos

source: Full chapter: :doc:`buildout_1`
es: Capítulo completo: :doc:`buildout_1`

source: We discussed the buildout used for this training
es: Se discutió el buildout usado para este entrenamiento

source: Since Plone 4.3.4 was released today you could update the buildout to use this version.
es: Desde que se lanzó Plone 4.3.4 hoy se puede actualizar la buildout para usar esta versión.

source: Change ``buildout.cfg`` to extend from the ``versions.cfg`` of Plone 4.3.4
es: Change ``buildout.cfg`` to extend from the ``versions.cfg`` of Plone 4.3.4 Cambie el archivo ``buildout.cfg`` para extenderlo desde el archivo ``versions.cfg`` de Plone 4.3.4

source: Creating addons to customize Plone
es: Creando complementos para personalizar Plone

source: Full chapter: :doc:`eggs1`
es: Capítulo completo: :doc:`eggs1`

source: We created a egg using ZopeSkel (not mr.bob).
es: Hemos creado un paquete egg usando ZopeSkel (no mr.bob).

source: The egg is called ``ploneconf.site``
es: El paquete egg es llamado ``ploneconf.site``

source: It will contain most of the code we write
es: Ese contendrá la mayor parte del código que escribimos

source: Does everybody have the code from ``ploneconf.site_sneak`` already?
es: ¿Ya todos tienen el código fuente del paquete ``ploneconf.site_sneak``?
