Repository: plone/training
Catalog: _locales/*/LC_MESSAGES/user_generated_content.po
Languages: es

source: Get the code!
es: ¡Obtén el código!

source: How do prospective speakers submit talks? We let them register on the site and grant right to create talks. For this we go back to changing the site through-the-web.
es: ¿Cómo hacer que los potenciales ponentes envíen sus charlas? Dejamos que se registren en el sitio y se le otorgan derecho a crear tipos de contenidos Talk. Para ello volvemos a cambiar el sitio a través de la Web.

source: In this chapter we:
es: En este capítulo vamos a:

source: allow self-registration
es: Permitir auto registro de usuario.

source: grant local roles
es: Otorgar roles locales.

source: create a custom workflow for talks
es: Crear un flujo de trabajo para los tipos de contenidos Talk.

source: Self-registration
es: Auto-registro

source: Go to the Security controlpanel at http://localhost:8080/Plone/@@security-controlpanel and Enable self-registration
es: Valla al panel de control de Seguridad en la dirección URL http://localhost:8080/Plone/@@security-controlpanel y Habilitar auto-registro

source: Leave "Enable User Folders" off unless you want a community site.
es: Deja "Habilitar carpetas de usuario" apagado a menos que quieras un sitio comunitario.

source: Constrain types
es: Restringir tipos de contenidos

source: On the talk folder select `Restrictions… <http://localhost:8080/Plone/the-event/talks/folder_constraintypes_form>`_ from the *Add new* menu. Only allow to add talks.
es: En la carpeta ``talks`` seleccione `Restricciones… <http://localhost:8080/Plone/the-event/talks/folder_constraintypes_form>`_ en el menú *Añadir nuevo...*. Solo permita agregar tipos de contenidos ``Talks``.

source: Grant local roles
es: Otorgar roles locales

source: Now all logged-in users can create and submit talks in this folder with the permission of the default workflow.
es: Ahora todos los Usuarios conectados pueden crear y enviar charlas en esta carpeta con el permiso del flujo de trabajo por defecto.

source: A custom workflow for talks
es: Un flujo de trabajo personalizado para las charlas

source: We still need to fix a problem: Authenticated users can see all talks, even the ones of other users in the private state. Since we don't want this we will create a modified workflow for talks. The new workflow will only let them see and edit talks they created themselves and not the ones of other users.
es: Todavía tenemos que solucionar un problema: los usuarios autenticados pueden ver todos los tipos de contenidos ``talks``, incluso los de otros usuarios en el estado privado. Ya que no queremos que esto vamos a crear un flujo de trabajo modificado para los tipos de contenidos ``talks``. El nuevo flujo de trabajo sólo les permitirá ver y editar los tipos de contenidos ``talks`` que han creado ellos mismos y no los de otros usuarios.

source: Go to the ZMI > portal_workflow
es: Valla a la herramienta ``ZMI`` > ``portal_workflow``

source: See how talks have the same workflow as most content ``(Default)``
es: Ver como los tipos de contenidos ``talks`` tiene el mismo flujo de trabajo como la mayoría del contenido ``(Por defecto)``

source: Go to the tab *Contents*, check the box next to ``simple_publication_workflow``, click ``copy`` and ``paste``.
es: Valla a la pestaña *Contents*, marque la casilla próxima a ``simple_publication_workflow``, haga clic en ``Copy`` y ``Paste``.

source: Rename the new workflow from *copy_of_simple_publication_workflow* to *talks_workflow*.
es: Renombrar el nuevo flujo de trabajo desde *copy_of_simple_publication_workflow* a *talks_workflow*.

source: Edit the workflow by clicking on it: Change the Title to *Talks Workflow*.
es: Edite el flujo de trabajo haciendo clic en: Change the Title to *Talks Workflow*.

source: Click on the tab *States* and click on *private* to edit this state. In the next view select the tab *Permissions*.
es: Haga clic en la pestaña *States* y haga clic en *private* y edite este estado. En la próximo vista seleccione en la pestaña *Permissions*.

source: Find the table column for the role *Contributor* and remove the permissions for ``Access contents information`` and ``View``. Note that the *Owner* (i.e. the Creator) still has some permissions.
es: Encuentra en la columna de la tabla para el rol *Colaborador* y quitar los permisos para ``Access contents information`` y ``View``. Tenga en cuenta que el rol *Propietario* (es decir, el rol Creador) todavía tiene algunos permisos.

source: Do the same for the state *pending*
es: Hacer lo mismo para el estado *pending*.

source: Go back to *portal_workflow* and set the new workflow ``talks_workflow`` for talks. Click *Change* and then *Update security settings*.
es: Valla a la herramienta *portal_workflow* y establecer el nuevo flujo de trabajo ``talks_workflow`` para los tipos de contenidos ``talks``. Haga clic *Change* y entonces *Update security settings*.

source: The addon `plone.app.workflowmanager <https://pypi.python.org/pypi/plone.app.workflowmanager>`_ provides a much nicer user-interface for this. The problem is you need a big screen for it and it can be pretty confusing as well.
es: El complemento `plone.app.workflowmanager <https://pypi.python.org/pypi/plone.app.workflowmanager>`_ provee una más agradable de interfaz de usuario para esto. El problema es que necesita una pantalla grande para él y que puede ser muy confuso también.

source: Done.
es: Hecho.

source: We don't want to do these steps for every new conference by hand so we move the changes into our package.
es: No queremos hacer estos pasos para cada nueva conferencia manualmente para que nos movemos los cambios en nuestro paquete.

source: export the GenericSetup step *Workflow Tool* in http://localhost:8080/Plone/portal_setup/manage_exportSteps.
es: Exporte el paso GenericSetup *Workflow Tool* en la siguiente dirección URL http://localhost:8080/Plone/portal_setup/manage_exportSteps.

source: drop the file ``workflows.xml`` into ``profiles/default``.
es: Lance el archivo ``workflows.xml`` dentro del directorio ``profiles/default``.

source: drop ``workflows/talks_workflow/definition.xml`` in ``profiles/default/workflows/talks_workflow/definition.xml``. The others are just definitions of the default-workflows and we only want things in our package that changes Plone.
es: Lance el archivo ``workflows/talks_workflow/definition.xml`` en ``profiles/default/workflows/talks_workflow/definition.xml``. Los otros son sólo definiciones de los flujos de trabajo por defecto y sólo queremos cosas en nuestro paquete que cambia Plone.

source: To enable self-registration add the following to ``profiles/default/registry.xml``:
es: Esto tiene que suceder en Python en una archivo `setuphandler.py <http://docs.plone.org/4/en/develop/addons/components/genericsetup.html#custom-installer-code-setuphandlers-py>`_ personalizable, ya que aún no existe un entorno exportable para esto.

source: Before Plone 5 this had to be done in python in a setuphandler (see below) since there was not yet an exportable setting for this.
es: Registrar un paso de importación en el archivo ``configure.zcml``. Será ejecutará automáticamente al volver a instalar el complemento.

source: Since the granting of local roles applies only to a certain folder in the site we would not always write code for it but do it by hand. But for testability and repeatability (there is a conference every year!) we should create the initial content structure automatically.
es: Tenga en cuenta que el módulo ``setuphandler`` tiene una dependencia en `typeinfo` porque sólo permitirá la creación de tipos de contenidos ``talks``. Para este tipo ya tiene que existir.

source: To run arbitrary code during the installation of a package we use a special import step, a `setuphandler <http://docs.plone.org/develop/addons/components/genericsetup.html#custom-installer-code-setuphandlers-py>`_
es: Agregue el archivo marcador ``profile/default/ploneconf.site_various.txt`` usado en la linea 18, usando el código anterior, con el siguiente contenido::

source: Our package already has such an import step registered in ``configure.zcml``. It will be automatically run when (re-)installing the addon.
es: Ya que se aplica sólo a una determinada carpeta en el sitio nosotros normalmente no escribe código para ello.

source: All GenericSetup import steps, including this one, are run for **every add-on product** when they are installed. To make sure that it is only run during installation of your package the code checks for a marker text file ``ploneconfsite_marker.txt``.
es: Pero podemos añadir fácilmente un método para el módulo ``setuphandler`` el cual cree la carpeta y se establece un cierto ajuste por ello.
