Repository: plone/training
Catalog: _locales/*/LC_MESSAGES/zpt.po
Languages: es

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capitulo (:doc:`Mas información <sneak>`) usando este comando en el directorio buildout:

source: Page Templates are HTML-files with some additional Information, written in TAL, METAL and TALES.
es: Plantillas de páginas son archivos HTML con alguna información adicional, escritas en TAL, METAL y TALES.

source: Page templates must be valid xml.
es: Las plantillas de página debe ser XML válido.

source: The three languages are:
es: Las tres lenguas son:

source: Templating XML/HTML using special Attributes
es: Plantillas XML / HTML usando con atributos especiales

source: Using TAL we include expressions into html
es: Usando TAL nosotros podemos incluir expresiones en HTML

source: defines the syntax and semantics of these expressions
es: define la sintaxis y la semántica de estas expresiones

source: this enables us to combine, re-use and nest templates together
es: esto nos permite combinar, la reutilización y las plantillas anidadas juntos

source: TAL and METAL are written like html-attribues (url, src, title). TALES are written like the values of html-attributes. A typical TAL-Statement looks like this:
es: TAL y METAL se escriben como atributos html (url, src, title). TALES están escritos como los valores de los atributos de html. Una declaración TAL típica tiene este aspecto:

source: It's used to modify the output:
es: Se utiliza para modificar la salida:

source: results in:
es: resultado en:

source: Let's try it. Open the file ``demoview.pt`` and add:
es: Vamos a intentarlo. Abra el archivo ``demoview.pt`` y añade:

source: TAL and TALES
es: TAL y TALES

source: Let's add some magic and modify the <p>-tag:
es: Vamos a añadir un poco de magia y modificar la etiqueta <p>:

source: This will result in:
es: Esto resultará en:

source: Without restarting Plone open http://localhost:8080/Plone/@@demoview.
es: Sin reiniciar Plone abra en el navegador http://localhost:8080/Plone/@@demoview.

source: The same happens with attributes. Replace the <p>-line with:
es: Lo mismo ocurre con los atributos. Vuelva a colocar la línea <p> con:

source: We used three TAL-Attributes here. This is the complete list of TAL-attributes:
es: Nosotros hemos utilizado los tres atributos TAL aquí. Esta es la lista completa de los atributos TAL:

source: define variables. We definded the variable url to the string "https://www.ploneconf.org/"
es: definir las variables. Nosotros definimos la variable url para la cadena "https://www.ploneconf.org/"

source: replace the content of an element. We replaced the default-content about some with "A even better conference"
es: reemplazar el contenido de un elemento. Hemos sustituido el valor por defecto de contenido con algunas como "A even better conference"

source: dynamically change element attributes. We set the html-attribute ``href`` to the variable ``a_fine_url``
es: cambiar dinámicamente atributos de los elementos. Nosotros hemos establecido el atributo href html a la variable ``a_fine_url``

source: tests, if the expression is true or false.
es: pruebas, si la expresión es verdadera o falsa.

source: repeats an iterable element, in our case the list of talks.
es: repite un elemento iterable, en nuestro caso, la lista de Charlas.

source: replace the content of an element like ``tal:content`` but removes the element only leaving the content.
es: reemplazar el contenido de un elemento como ``tal:content`` , pero se elimina el elemento sólo dejando el contenido.

source: remove an element, leaving the content of the element.
es: eliminar un elemento, dejando el contenido del elemento.

source: handle errors.
es: controlar los errores.

source: python-expressions
es: expresiones python

source: So far we only used one TALES expression (the ``string:``-bit). Let's use a different TALES-expression now. With ``python:`` we can use python-code. A simple example:
es: Hasta ahora sólo utilizamos una expresión TALES (el bit ``string:``). Usemos una expresión TALES diferente ahora. Con ``python:`` podemos usar código python. Un ejemplo sencillo:

source: And another:
es: Y otro:

source: With python-expressions
es: Con expresiones python

source: you can only write single statements
es: sólo se puede escribir declaraciones individuales

source: you could import things but you should not (example: ``tal:define="something modules/Products.PythonScripts/something;``).
es: usted podría importar cosas pero no debe (ejemplo: ``tal:define="something modules/Products.PythonScripts/something;``).

source: If it's true, then the tag is rendered.
es: Si es cierto, entonces la etiqueta se representa.

source: If it's false then the tag **and all its children** are removed and no longer evaluated.
es: Si es false, entonces la etiqueta **y todos sus hijos** se retiran y ya no se evalúa.

source: We can reverse the logic by prepending a ``not:`` to the expression.
es: Podemos invertir la lógica anteponiendo un ``not:`` a la expresión.

source: Let's add another TAL-Attribute to our above example::
es: Vamos a añadir otro atributo TAL para nuestro ejemplo anterior:

source: We could also test for the number of talks::
es: También pudimos probar que el número de charlas:

source: or if a certain talk is in the list of talks::
es: o si una cierta charla está en la lista de charlas:

source: Let's try another statement:
es: Probemos otra declaración:

source: We change the markup a little to construct a list in which there is an ``<li>`` for every talk:
es: Cambiamos el formato un poco para construir una lista en la que hay una lista ``<li>`` para cada charla:

source: path-expressions
es: expresiones de rutas

source: Regarding TALES so far we used ``string:`` or ``python:`` or only variables. The next and most common expression are path-expressions. Optionally you can start a path-expression with ``path:``
es: En cuanto TALES hasta ahora hemos utilizado la ``string:`` o ``python:`` o sólo las variables. La expresión siguiente y más comunes son de path-expressions. Opcionalmente se puede iniciar path-expression con el ``path:``

source: Every path expression starts with a variable name. It can either be an object like ``context``, ``view`` or ``template`` or a variable defined earlier like ``talk``.
es: Cada expresión de ruta comienza con un nombre de variable. Puede ser tanto un objeto como ``context``, ``view``, ``template`` o una variable definida anteriormente como ``charla``.

source: After the variable we add a slash ``/`` and the name of a sub-object, attribute or callable. The '/' is used to end the name of an object and the start of the property name. Properties themselves may be objects that in turn have properties.
es: Después de la variable se añade una barra ``/`` y el nombre de un sub-objeto, atributo o método llamable. El '/' se utiliza para terminar el nombre de un objeto y el inicio del nombre de la propiedad. Mismas propiedades pueden ser objetos que a su vez tienen propiedades.

source: We can chain several of those to get to the information we want.
es: Nos puede encadenar varios de los elementos para obtener la información que queremos.

source: This would return the value of the form-dictionary of the HTTPRequest-object. Useful for form-handling.
es: Esto devolverá el valor de la forma de diccionario del objeto HTTPRequest. Útil para la forma de manipulación.

source: The ``|`` ("or") character is used to find an alternative value to a path if the first path evaluates to ``nothing`` or does not exist.
es: El ``|`` ("o") se utiliza para encontrar un valor alternativo a un camino si la primera ruta se evalúe como ``nothing`` o no existe.

source: This returns the id of the context if it has no title.
es: Esto devuelve el id del contexto si no tiene título.

source: This returns nothing if there is no 'average_rating' for a talk. What will not work is ``tal:content="python:talk['average_rating'] or ''"``. Who knows what this would yield?
es: Esto devuelve nada si no hay 'average_rating' para una charla. Lo que no funciona es ``tal:content="python:talk['average_rating'] or ''"``. ¿Quién sabe lo que esto produciría?

source: We'll get ``KeyError: 'average_rating'``. It is very bad practice to use ``|`` too often since it will swallow errors like a typo in ``tal:content="talk/averange_ratting | nothing"`` and you might wonder why there are no ratings later on...
es: Conseguiremos ``KeyError: 'average_rating'``. Es muy mala práctica, use ``|`` con demasiada frecuencia, ya que se tragará errores como un error tipográfico en ``tal:content="talk/averange_ratting | nothing"`` y es posible que se preguntan por qué no existen calificaciones más tarde...

source: You can't and should not use it to prevent errors like a try/except-block.
es: No puede y no debe utilizarlo para evitar errores como un bloque try / except.

source: There are several **built in variables** that can be used in paths:
es: Hay varias **variables incorporado** que se pueden utilizar en caminos:

source: The most frequently used one is ``nothing`` which is the equivalent to None
es: El más utilizado uno es ``nothing`` que es el equivalente a None

source: A dict of all the available variables is ``CONTEXTS``
es: Un diccionario de todas las variables disponibles es ``CONTEXTS``

source: Useful for debugging :-)
es: Muy útil para depuración :-)

source: Pure TAL-blocks
es: Puro bloques TAL

source: We can use TAL-attributes without HTML-Tags. This is useful when we don't need to add any tags to the markup
es: Podemos utilizar atributos TAL sin marcas HTML. Esto es útil cuando no es necesario añadir las etiquetas para el marcado

source: Syntax:
es: Sintaxis:

source: Examples:
es: Ejemplos:

source: handling complex data in templates
es: manejo de datos complejos en plantillas

source: Let's move on to a little more complex data. And to another TAL-atrribute:
es: Vamos a pasar a un poco más complejo de datos. Y a otro atributo TAL:

source: replace the content of an element and removes the element only leaving the content.
es: reemplazar el contenido de un elemento y elimina el elemento dejando sólo el contenido.

source: Example:
es: Ejemplo:

source: this results in:
es: este resulta en:

source: ``tal:replace`` drops it's own base-tag in favor of the result of the TALES-expression. Thus the original ``<img... >`` is replaced. But the result is escaped by default.
es: ``tal:replace`` cae su propia base de etiquetas a favor del resultado de la expresión TALES. Por lo tanto el original ``<img... >`` se sustituye. Pero el resultado se escapó por defecto.

source: To prevent escaping we use ``structure``
es: Para prevenir que se escapen utilizamos ``structure``

source: Now let's emulate a typical Plone structure by creating a dictionary.
es: Ahora vamos a emular una estructura típica Plone mediante la creación de un diccionario.

source: We emulate a list of talks and display information about them in a table. We'll get back to the list of talks later when we use the real talk-objects that we created with dexterity.
es: Nosotros emulamos una lista de charlas y mostrar información en una tabla. Nos pondremos en contacto a la lista de las charlas más tarde, cuando se utilizan los verdaderos objetos charlas que hemos creado con dexterity.

source: To complete the list here are the TAL-Attributes we have not yet used:
es: Para completar la lista que aquí están los atributos TAL que no hemos utilizado todavía:

source: Omit the element tags, leaving only the inner content.
es: Omita las etiquetas de los elementos, dejando sólo el contenido interno.

source: When an element has multiple statements, they are executed in this order:
es: Cuando un elemento tiene múltiples sentencias, se ejecutan en este orden:

source: content or replace
es: content o replace

source: METAL and macros
es: METAL y macros

source: Why is our output so ugly? How do we get our html to render in Plone the UI?
es: ¿Por qué nuestra vista es tan feo?, ¿Cómo conseguimos nuestro HTML para representar en la interfaz de usuario de Plone?

source: We use METAL (Macro Extension to TAL) to define slots that we can fill and macros that we can reuse.
es: Utilizamos METAL (extensión macro para TAL) para definir ranuras que podemos llenar y macros que podemos reutilizar.

source: We add to the ``<html>``-tag::
es: Agregamos a la etiqueta ``<html>``::

source: And then wrap the code we want to put in the content-area of Plone in:
es: Y a continuación, ajustar el código que queremos poner en el área de contenido de Plone en:

source: This will put our code in a section defined in the main_template called "content-core".
es: Esto pondrá a nuestro código de una sección definida en el main_template llamado "content-core".

source: The template should now look like this:
es: La plantilla de ahora debería tener este aspecto:

source: Since the demoview only used content from the template, not from the context that it is called on it makes little sense to have the edit-bar. We hide it by setting the respective variable on the current request with python to 1: ``request.set('disable_border', 1)``.
es: Desde la vista demoview solamente es utilizada el contenido de la plantilla, no por el contexto que le toca no tiene mucho sentido tener la barra de edición. Nos lo ocultamos estableciendo la variable correspondiente en el request actual con el python a 1: ``request.set('disable_border', 1)``.

source: The easiest way to do this is to define a dummy-variable. Dummy because it is never used except to allow us to execute some code.
es: La manera más fácil de hacer esto es definir una variable dummy. Dummy porque nunca se usa, salvo que nos permita ejecutar algún código.

source: macros in browser-views
es: macros en browser-views

source: Define a macro in a new file ``macros.pt``
es: Define un macro en un nuevo archivo ``macros.pt``

source: Register it as a BrowserView (this time without a python-class) in zcml:
es: Registrarse como BrowserView (esta vez sin una clase python) en zcml:

source: Reuse the macro it in the template ``demoview.pt``:
es: Reutilización de la macro en la plantilla ``demoview.pt``:

source: Accessing Plone from the template
es: Accediendo a Plonde desde la plantilla

source: In our template we have access to the context object on which the view is called on, the browser-view itself (i.e. all python-methods we'll put in the view later on), the request and response objects and with these we can get almost anything.
es: En nuestra plantilla tenemos acceso al objeto de contexto en el que la vista se llama en adelante, la propia browser-views (es decir, todos los métodos de python vamos a poner en el punto de vista más adelante), los objetos request y response y con ellas podemos conseguir casi cualquier cosa.

source: In templates we can also access other browser-views. Some of those exist to provide easy access to methods we often need::
es: En las plantillas también podemos acceder a otras browser-views. Algunos de los que existen para facilitar el acceso a los métodos que a menudo necesitamos::

source: The BrowserView ``plone.app.layout.globals.context.ContextState`` holds useful methods having to do with the current context object such as ``is_default_page``
es: El BrowserView ``plone.app.layout.globals.context.ContextState`` tiene métodos útiles que tienen que ver con el objeto de contexto actual como ``is_default_page``

source: The BrowserView ``plone.app.layout.globals.portal.PortalState`` holds methods for the portal like ``portal_url``
es: El BrowserView ``plone.app.layout.globals.portal.PortalState`` tiene métodos para el portal como ``portal_url``

source: The BrowserView ``plone.app.layout.globals.tools.Tools`` gives access to the most importan tools like ``plone_tools/catalog``
es: El BrowserView ``plone.app.layout.globals.tools.Tools`` da acceso a las herramientas mas importante como ``plone_tools/catalog``

source: These are very widely used and there are many more.
es: Estos son muy utilizados y hay muchos más.

source: What we missed
es: Lo que echamos de menos

source: There are some things we did not cover so far:
es: Hay algunas cosas que no nos cubrimos hasta el momento:

source: checks if an object or an attribute exists (seldom used)
es: comprueba si existe un objeto o un atributo (rara vez utilizada)

source: to explicitly not call a callable.
es: que explícitamente no llamar a un metodo llamable.

source: If we refer to content objects, without using the nocall: modifier these objects are unnecessarily rendered in memory as the expression is evaluated.
es: Si nos referimos a objetos de contenido sin usar el modificador nocall: estos objetos son innecesariamente representados en la memoria como la expresión se evaluada.

source: ``i18n:translate`` and ``i18n:domain``
es: ``i18n:translate`` y ``i18n:domain``

source: the strings we put in templates can be translated automatically.
es: las cadenas que ponemos en las plantillas se pueden traducir de forma automática.

source: There is a lot more about TAL, TALES and METAL that we have not covered. You'll only learn it if you keep reading, writing and customizing templates.
es: Hay mucho más acerca de TAL, TALES y METAL que no hemos cubierto. Usted solamente aprenderá si sigues leyendo, escribiendo y personalización de plantillas.

source: Using Zope Page Templates: http://docs.zope.org/zope2/zope2book/ZPT.html
es: Usando Zope Page Templates: http://docs.zope.org/zope2/zope2book/ZPT.html

source: Zope Page Templates Reference: http://docs.zope.org/zope2/zope2book/AppendixC.html
es: Referencia de Zope Page Templates: http://docs.zope.org/zope2/zope2book/AppendixC.html

source: Chameleon is the successor of TAL and will be shipped in Plone 5.
es: Chameleon es el sucesor de TAL y serán incorporado en Plone 5.

source: Plip for Chameleon: https://dev.plone.org/ticket/12198
es: Plip para Chameleon: https://dev.plone.org/ticket/12198

source: Homepage: http://www.pagetemplates.org/
es: Página principal: http://www.pagetemplates.org/

source: Integration-layer for Plone: `five.pt <https://pypi.python.org/pypi/five.pt>`_
es: Capa de Integración para Plone: `five.pt <https://pypi.python.org/pypi/five.pt>`_

source: In Plone 4 we still use the default ZPT.
es: En Plone 4 nosotros usaremos ZPT por defecto.
